; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v1 ?v9)
             (pred_7 ?v6 ?v7)
             (pred_1 ?v1 ?v7)
             (pred_3 ?v5 ?v1 )
	     (pred_2 ?v1)
             (pred_4 ?v3)
             (pred_11 ?v6)
             (pred_10 ?v7)
             (pred_9 ?v1)
             (pred_8 ?v6)
             (pred_6 ?v1)
             (pred_5 ))



(:action op_3
:parameters (?v13 ?v10 ?v12 ?v4)
:precondition (and (pred_4 ?v13) (pred_4 ?v10) (pred_11 ?v12) (pred_10 ?v4)
          (pred_12 ?v13 ?v10) (pred_7 ?v12 ?v4)
                   (pred_1 ?v10 ?v4) (pred_2 ?v13) 
                   (pred_9 ?v10) (pred_8 ?v12))
:effect (and  (pred_6 ?v10) (not (pred_9 ?v10))))


(:action op_1
:parameters (?v13 ?v8)
:precondition (and (pred_4 ?v13) (pred_4 ?v8)
               (pred_2 ?v13) (pred_12 ?v13 ?v8) (pred_6 ?v8))
:effect (and (pred_2 ?v8) (not (pred_2 ?v13))))

(:action op_4
:parameters (?v13 ?v12)
:precondition (and (pred_4 ?v13) (pred_11 ?v12) 
                  (pred_2 ?v13) (pred_3 ?v12 ?v13) (pred_5 ))
:effect (and (pred_8 ?v12)
   (not (pred_3 ?v12 ?v13)) (not (pred_5 ))))


(:action op_2
:parameters (?v13 ?v11 ?v2)
:precondition (and (pred_4 ?v13) (pred_11 ?v11) (pred_11 ?v2)
                  (pred_2 ?v13) (pred_8 ?v2) (pred_3 ?v11 ?v13))
:effect (and (pred_8 ?v11) (pred_3 ?v2 ?v13)
        (not (pred_8 ?v2)) (not (pred_3 ?v11 ?v13))))

(:action op_5
:parameters (?v13 ?v12)
:precondition (and (pred_4 ?v13) (pred_11 ?v12) 
                  (pred_2 ?v13) (pred_8 ?v12))
:effect (and (pred_5 ) (pred_3 ?v12 ?v13) (not (pred_8 ?v12)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_11 obj_14 obj_13 obj_18 obj_17 obj_20 obj_12 obj_10 obj_16 obj_02 obj_05 obj_03 obj_01 obj_06 obj_07
    obj_19 obj_15
    obj_09 obj_04 obj_21
    )

    (:init
       (pred_5)

       (pred_4 obj_08)
       (pred_4 obj_11)
       (pred_4 obj_14)
       (pred_4 obj_13)
       (pred_4 obj_18)
       (pred_4 obj_17)
       (pred_4 obj_20)
       (pred_4 obj_12)
       (pred_4 obj_10)
       (pred_4 obj_16)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_07)
       (pred_10 obj_19)
       (pred_10 obj_15)
       (pred_11 obj_09)
       (pred_11 obj_04)
       (pred_11 obj_21)

       (pred_12 obj_08 obj_18)
       (pred_12 obj_08 obj_11)
       (pred_12 obj_11 obj_17)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_11 obj_08)
       (pred_12 obj_14 obj_20)
       (pred_12 obj_14 obj_13)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_13 obj_12)
       (pred_12 obj_13 obj_14)
       (pred_12 obj_18 obj_10)
       (pred_12 obj_18 obj_17)
       (pred_12 obj_18 obj_08)
       (pred_12 obj_17 obj_16)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_11)
       (pred_12 obj_17 obj_18)
       (pred_12 obj_20 obj_02)
       (pred_12 obj_20 obj_12)
       (pred_12 obj_20 obj_14)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_12 obj_05)
       (pred_12 obj_12 obj_13)
       (pred_12 obj_12 obj_20)
       (pred_12 obj_10 obj_03)
       (pred_12 obj_10 obj_16)
       (pred_12 obj_10 obj_18)
       (pred_12 obj_16 obj_01)
       (pred_12 obj_16 obj_02)
       (pred_12 obj_16 obj_17)
       (pred_12 obj_16 obj_10)
       (pred_12 obj_02 obj_06)
       (pred_12 obj_02 obj_05)
       (pred_12 obj_02 obj_20)
       (pred_12 obj_02 obj_16)
       (pred_12 obj_05 obj_07)
       (pred_12 obj_05 obj_12)
       (pred_12 obj_05 obj_02)
       (pred_12 obj_03 obj_01)
       (pred_12 obj_03 obj_10)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_16)
       (pred_12 obj_01 obj_03)
       (pred_12 obj_06 obj_07)
       (pred_12 obj_06 obj_02)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_07 obj_05)
       (pred_12 obj_07 obj_06)
       (pred_9 obj_10)
       (pred_9 obj_01)
       (pred_9 obj_12)
       (pred_1  obj_10 obj_19)
       (pred_1  obj_01 obj_15)
       (pred_1  obj_12 obj_19)
       (pred_6 obj_08)
       (pred_6 obj_11)
       (pred_6 obj_14)
       (pred_6 obj_13)
       (pred_6 obj_18)
       (pred_6 obj_17)
       (pred_6 obj_20)
       (pred_6 obj_16)
       (pred_6 obj_02)
       (pred_6 obj_05)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_07)

       (pred_7  obj_09 obj_19)
       (pred_7  obj_04 obj_15)
       (pred_7  obj_21 obj_19)
       (pred_3 obj_09 obj_11)
       (pred_3 obj_04 obj_17)
       (pred_3 obj_21 obj_12)
       (pred_2 obj_20)
    )

    (:goal (and
       (pred_3 obj_09 obj_12)
    ))
(:constraints
  (always (not (pred_2 obj_14)))
)
)

; plan
1. (op_1 obj_20 obj_17)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_17)
   goals met: 0 of 1
2. (op_1 obj_17 obj_11)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_11)
   goals met: 0 of 1
3. (op_4 obj_11 obj_09)
   deleted: (pred_3 obj_09 obj_11) (pred_5)
   added: (pred_8 obj_09)
   goals met: 0 of 1
4. (op_1 obj_11 obj_17)
   deleted: (pred_2 obj_11)
   added: (pred_2 obj_17)
   goals met: 0 of 1
5. (op_1 obj_17 obj_20)
   deleted: (pred_2 obj_17)
   added: (pred_2 obj_20)
   goals met: 0 of 1
6. (op_3 obj_20 obj_12 obj_09 obj_19)
   deleted: (pred_9 obj_12)
   added: (pred_6 obj_12)
   goals met: 0 of 1
7. (op_1 obj_20 obj_12)
   deleted: (pred_2 obj_20)
   added: (pred_2 obj_12)
   goals met: 0 of 1
8. (op_2 obj_12 obj_21 obj_09)
   deleted: (pred_8 obj_09) (pred_3 obj_21 obj_12)
   added: (pred_8 obj_21) (pred_3 obj_09 obj_12)
   goals met: 1 of 1
